#ifndef G5_DIAGE2MAPPING_PD_H
#define G5_DIAGE2MAPPING_PD_H
/* PRQA S 3619 EOF */ /* << 2010 01 08, compiler allows whitespaces:due to readable code, keep whitespaces! >> */
/* PRQA S 2217 EOF */ /* << 2011 03 03, Code would be not readable >> */
/* PRQA S 750,759 EOF *//*<< 0750:union needed to reduce RAM usage >>*/
/* PRQA S 1015 EOF *//*<< 1015:__far needed for IAR compiler  >>*/
/* PRQA S 3453 EOF *//*<< Macro is more readle and convinient in this situation >>*/
/* PRQA S 857 EOF *//*<< Macro exceeds 1024 number  >>*/


/******************************************************************************/
/* History                                                                    */
/*----------------------------------------------------------------------------*/
/* Date      VDR_Number  Author   Description                                       */
/*-DD.MM.YY-------------------------------------------------------------------*/
/* see G5_DiagE2Mapping_Konzern.h for old history */
/* 15.09.14   VCO_183 NB  Rearrangement of EEPROM */
/* 15.09.14   VCO_184 NB Checksum for calibration data */
/* 22.09.14   VCO_152 NB Customenr part number shall be stored in EEPROM */
/* 29.09.14   VCO_172 NB AUDI_Coding of Parkposition on LIN */
/* 18.03.15   VCO_231 MP Default values of the Kodierbyte_0 and RSControlFlags for no-rain-variants*/
/* 20.03.15   VCO_215 NB All: Project specific extensions in the main stream Release 8 */

  {CB_DEF_WWSS_01                        ,CB_MIN_WWSS_01                        ,CB_MAX_WWSS_01                        },      /*328*/
  {CB_DEF_SOSES_01                       ,CB_MIN_SOSES_01                       ,CB_MAX_SOSES_01                       },      /*329*/
#ifdef ASIC_TEST 
  {CB_DEF_ASIC_FRAME_01                 ,CB_MIN_ASIC_FRAME_01                 ,CB_MAX_ASIC_FRAME_01                    },      /*330*/
  {CB_DEF_ASIC_FRAME_02                 ,CB_MIN_ASIC_FRAME_02                 ,CB_MAX_ASIC_FRAME_02                    },      /*331*/
  {CB_DEF_ASIC_FRAME_03                 ,CB_MIN_ASIC_FRAME_03                 ,CB_MAX_ASIC_FRAME_03                    },      /*332*/
  {CB_DEF_ASIC_FRAME_04                 ,CB_MIN_ASIC_FRAME_04                 ,CB_MAX_ASIC_FRAME_04                    },      /*333*/
#endif
  {CB_DEF_ASIC_RCTR_REG                  ,CB_MIN_ASIC_RCTR_REG                  ,CB_MAX_ASIC_RCTR_REG                  },      /*334*/
  {CB_DEF_ASIC_RFCTR_REG                 ,CB_MIN_ASIC_RFCTR_REG                 ,CB_MAX_ASIC_RFCTR_REG                 },      /*335*/  
  {CB_DEF_ERROR_ACTIVE_1                 ,CB_MIN_ERROR_ACTIVE_1                 ,CB_MAX_ERROR_ACTIVE_1                 },      /*336*/  
  {CB_DEF_ERROR_ACTIVE_2                 ,CB_MIN_ERROR_ACTIVE_2                 ,CB_MAX_ERROR_ACTIVE_2                 },      /*337*/
  {CB_DEF_ERROR_ACTIVE_3                 ,CB_MIN_ERROR_ACTIVE_3                 ,CB_MAX_ERROR_ACTIVE_3                 },      /*338*/  
  {CB_DEF_ERASE_COUNTER                 ,CB_MIN_ERASE_COUNTER                 ,CB_MAX_ERASE_COUNTER                 },      /*339*/  
  {CB_DEF_ERASE_COUNTER                 ,CB_MIN_ERASE_COUNTER                 ,CB_MAX_ERASE_COUNTER                 },      /*340*/  
  {CB_DEF_ERASE_COUNTER                 ,CB_MIN_ERASE_COUNTER                 ,CB_MAX_ERASE_COUNTER                 },      /*341*/  
  {CB_DEF_ERASE_COUNTER                 ,CB_MIN_ERASE_COUNTER                 ,CB_MAX_ERASE_COUNTER                 },      /*342*/  
  {CB_DEF_VARIANT_ID                     ,CB_MIN_VARIANT_ID                     ,CB_MAX_VARIANT_ID                     },      /*343*/  
  {(byte)(CW_DEF_FUNCTION_ID&0xFF)       ,(byte)(CW_MIN_FUNCTION_ID&0xFF)       ,(byte)(CW_MAX_FUNCTION_ID&0xFF)       },      /*344*/
  {(byte)(CW_DEF_FUNCTION_ID>>8)         ,(byte)(CW_MIN_FUNCTION_ID>>8)         ,(byte)(CW_MAX_FUNCTION_ID>>8)         },      /*345*/
  {CB_DEF_ERR_DATA_01                    ,CB_MIN_ERR_DATA_01                    ,CB_MAX_ERR_DATA_01                    },      /*346*/
  {CB_DEF_LINID_SPARE_01                 ,CB_MIN_LINID_SPARE_01                 ,CB_MAX_LINID_SPARE_01                 },      /*347*/
  
};
#pragma constseg=default               /* VDR_671 IAR 4xx part*/

const byte cab_SI_Transmission_Offsett[8] = {15,20,25,30,10,6,3,0}; /*definition of Korrekturfaktor Vorfeldempfanger offset*/

#else

extern const byte cab_SI_Transmission_Offsett[8];


extern const byte __far cb_EEPROMDataDefaultMinMax_PD_g[cb_NumberofEEPROMCells_PD_g][3];
#define EXTERN  extern
#endif


typedef struct {
  byte ProductionData_g[12];          /* 256-267 */
  byte EEKodierbyte2_g;               /* 268 */
  byte EEKodierbyte1_g;               /* 269  */
  byte EEKodierbyte0_g;               /* 270  */
  byte ALS1_4_Setting_g;              /* 271 */
  byte ALS5_6_INREC_Setting_g;        /* 272 */
  byte ASIC_DIAGV_g;                  /* 273 */
  word A_Factor_ALS1_g;               /* 274,275 */
  word A_Factor_ALS2_g;               /* 276,277 */
  word A_Factor_ALS3_g;               /* 278,279 */
  word A_Factor_ALS4_g;               /* 280,281 */
  word A_Factor_ALS5_g;               /* 282,283 */
  word A_Factor_ALS6_g;               /* 284,285 */
  word A_Factor_INREC_g;              /* 286,287 */
  byte B_Factor_Iref_Lo_Gain_Lo_g;    /* 288 */
  byte B_Factor_Iref_Lo_Gain_Hi_g;    /* 289 */
  byte B_Factor_Iref_Hi_Gain_Lo_g;    /* 290 */
  byte B_Factor_Iref_Hi_Gain_Hi_g;    /* 291 */
  word CRC_Checksum_calibration_g;    /* 292,293 */       
  byte Standby_rain_measurement_1_g;  /*294*/
  byte Standby_rain_measurement_2_g;  /*295*/
  byte Standby_rain_measurement_3_g;  /*296*/
  byte Standby_rain_measurement_4_g;  /*297*/
  byte Standby_rain_measurement_5_g;  /*298*/
  byte Standby_rain_measurement_6_g;  /*299*/
  byte ASIC_Sched_Config_g ;          /*300*/ 
  byte ASIC_LCTR_g ;                  /*301*/ 
  byte NO_RAIN_PRESENT_THRSH_HB_g ;   /*302*/ 
  byte NO_RAIN_PRESENT_THRSH_LB_g ;   /*303*/ 
  byte STBY_REGV_Imbalance_g ;        /*304*/ 
  byte RSControlFlags;                /*305*/
  byte IDFSs_Enh_01_g;          /*306  */ 
  byte HardwareStand[2];              /* 307, 308*/          
  byte Produktionsdaten[4];           /* 309, 310, 311, 312 */
  byte Fertigungsdatum[3];            /* 313, 314, 315*/ 
  byte Audi_HW_Partnumber[8];          /*316,317,318,319,320,321,322,323*/ 
  byte NAD;                           /*324*/
  byte IDFSs_01;                      /*325*/
  byte IDRLSs_01;                     /*326*/
  byte IDBCM1_LIN1_01;                /*327*/
  byte IDWWSs_01;                     /*328*/
  byte IDSOSES_01 ;                   /*329*/ 
#ifdef ASIC_TEST
  byte ASIC_Frame_01_g;               /*330*/ 
  byte ASIC_Frame_02_g;               /*331*/ 
  byte ASIC_Frame_03_g;               /*332*/ 
  byte ASIC_Frame_04_g;               /*333*/ 
#endif
  byte ASIC_RCTR_REG_g ;              /*334*/ 
  byte ASIC_RFCTR_REG_g ;             /*335*/ 
  byte Error_Active_1_g ;             /*336*/   
  byte Error_Active_2_g ;             /*337*/   
  byte Error_Active_3_g ;             /*338*/    
  byte Erase_counter[4] ;             /*339*/  
  byte VariantID_g;            /*343*/ 
  word FunctionID_g;           /*344,345*/ 
  byte IDERRDATA_01 ;                /*346*/ 
  byte IDSPARE_01 ;                /*347*/ 
} s_rb_EEPROMStruct_PD_g;



typedef union {
  unsigned char _c[cb_NumberofEEPROMCells_PD_g];
  s_rb_EEPROMStruct_PD_g EEPROMStructPD;
} s_rb_EEPROMStructPD_buff_g;



/* PRQA S 3116,0759 4*//*<< 3116:#pragma needed for IAR compiler and MISRA, 0759:union needed to reduce RAM usage >>*/

EXTERN  s_rb_EEPROMStructPD_buff_g EEPROM_Struct_PD;

#define rb_Kodierbyte0_g                                EEPROM_Struct_PD.EEPROMStructPD.EEKodierbyte0_g 
#define rb_Kodierbyte1_g                                EEPROM_Struct_PD.EEPROMStructPD.EEKodierbyte1_g 
#define rb_Kodierbyte2_g                                EEPROM_Struct_PD.EEPROMStructPD.EEKodierbyte2_g 
#define rb_ALS1_4_Setting_g                             EEPROM_Struct_PD.EEPROMStructPD.ALS1_4_Setting_g 
#define rb_ALS5_6_INREC_Setting_g                       EEPROM_Struct_PD.EEPROMStructPD.ALS5_6_INREC_Setting_g 
