#ifndef G5_DIAGE2MAPPING_KONZERN_H
#define G5_DIAGE2MAPPING_KONZERN_H
/* PRQA S 3619 EOF */ /* << 2010 01 08, compiler allows whitespaces:due to readable code, keep whitespaces! >> */
/* PRQA S 2217 EOF */ /* << 2011 03 03, Code would be not readable >> */

/* MODULE SPECIFICATION
* %PCMS_HEADER_SUBSTITUTION_START:%
* Name:
* %PID:%
* %PM:%
* Description:
* %PL:%
*
*************************************************/
/* %PCMS_HEADER_SUBSTITUTION_END:% */

/******************************************************************************/
/* History                                                                    */
/*----------------------------------------------------------------------------*/
/* Date      VDR_Number     Description                                       */
/*-DD.MM.YY-------------------------------------------------------------------*/
/* 12.07.11  VDR_682  AL    Adapt Default Values for Tunneldelay*/
/* 27.06.11  VDR_671  AL    Move Consts to Bootseg2 to have space for changes in RLS_LIN_B8.c*/
/* 21.02.11  VCO_094  AL    Tunnel detection improvement*/
/* 22.10.10  VC0_081  AL    new EEPROM Varaibles for HT-Function, new Default*/
/* 18.11.10  VCO_086  AL    implement FS-Services for Diagnostics*/ 
/* 29.10.10  VDR_592  AL    update Default Variables*/
/* 19.10.10  VC0_081  AL    new EEPROM Varaibles for HT-Function, adpat Default EEPROM parameter*/
/* 30.08.10  VC074    AL    changes to allow compilation with gen3_5*/

  {CB_DEF_REGULATION48THRESHOLD          ,CB_MIN_REGULATION48THRESHOLD          ,CB_MAX_REGULATION48THRESHOLD          },      // 400
  {CB_DEF_REGULATION48LIGHTONTIME        ,CB_MIN_REGULATION48LIGHTONTIME        ,CB_MAX_REGULATION48LIGHTONTIME        },      // 401
  {CB_DEF_VERYBRIGHTINTUNNELDELAY        ,CB_MIN_VERYBRIGHTINTUNNELDELAY        ,CB_MAX_VERYBRIGHTINTUNNELDELAY        },     // 402
  {CB_DEF_COMBINED_FW_AL_THRS            ,CB_MIN_COMBINED_FW_AL_THRS            ,CB_MAX_COMBINED_FW_AL_THRS            },     // 403  
  {CB_DEF_DYN_COMP_CCD_MINUS_1           ,CB_MIN_DYN_COMP_CCD_MINUS_1           ,CB_MAX_DYN_COMP_CCD_MINUS_1           },     // 404 
  {CB_DEF_DYN_COMP_CCD_MINUS_2           ,CB_MIN_DYN_COMP_CCD_MINUS_2           ,CB_MAX_DYN_COMP_CCD_MINUS_2           },     // 405  
  {CB_DEF_MAXTEMPERATUREOFFSETT          ,CB_MIN_MAXTEMPERATUREOFFSETT          ,CB_MAX_MAXTEMPERATUREOFFSETT          },      // 406   
  {CB_DEF_ASIC_AFSTHR_REG                ,CB_MIN_ASIC_AFSTHR_REG                ,CB_MAX_ASIC_AFSTHR_REG                },      // 407
  {CB_DEF_E2_RESERVED_I2                 ,CB_MIN_E2_RESERVED_I2                 ,CB_MAX_E2_RESERVED_I2                 },      // 408
  {CB_DEF_INC_SPEICHER                   ,CB_MIN_INC_SPEICHER                   ,CB_MAX_INC_SPEICHER                   },      // 409
  {CB_DEF_I2C_DEBUG_CONFIG               ,CB_MIN_I2C_DEBUG_CONFIG               ,CB_MAX_I2C_DEBUG_CONFIG               },      // 410
#ifdef ASIC_TEST
  {CB_DEF_ASIC_FRAME_01                 ,CB_MIN_ASIC_FRAME_01                 ,CB_MAX_ASIC_FRAME_01                 },      // 411
  {CB_DEF_ASIC_FRAME_02                 ,CB_MIN_ASIC_FRAME_02                 ,CB_MAX_ASIC_FRAME_02                 },      // 412
  {CB_DEF_ASIC_FRAME_03                 ,CB_MIN_ASIC_FRAME_03                 ,CB_MAX_ASIC_FRAME_03                 },      // 413
  {CB_DEF_ASIC_FRAME_04                 ,CB_MIN_ASIC_FRAME_04                 ,CB_MAX_ASIC_FRAME_04                 },      // 414
#endif
  {CB_DEF_SOFTWARESTAND_0                ,CB_MIN_SOFTWARESTAND_0                ,CB_MAX_SOFTWARESTAND_0                },      // 415
  {CB_DEF_SOFTWARESTAND_1                ,CB_MIN_SOFTWARESTAND_1                ,CB_MAX_SOFTWARESTAND_1                },      // 416
  {CB_DEF_SOFTWARESTAND_2                ,CB_MIN_SOFTWARESTAND_2                ,CB_MAX_SOFTWARESTAND_2                },      // 417
  {CB_DEF_SOFTWARESTAND_3                ,CB_MIN_SOFTWARESTAND_3                ,CB_MAX_SOFTWARESTAND_3                },       // 418    (Muss immer am Schluss sein!!!)

};
#pragma constseg=default               /* VDR_671 IAR 4xx part*/

const byte cab_SI_Transmission_Offsett[8] = {15,20,25,30,10,6,3,0}; /*definition of Korrekturfaktor Vorfeldempfanger offset*/

#else

extern const byte cab_SI_Transmission_Offsett[8];


extern const byte __far cb_EEPROMDataDefaultMinMax_g[cb_NumberofEEPROMCells_g][3];
#define EXTERN  extern
#endif

#define CB_OFFSETT_ADDIT_NOM  64

typedef struct {
  
  byte EEKodierbyte2_g;               /* 256 fest*/
  byte EEKodierbyte1_g;               /* 257 fest*/
  byte EEKodierbyte0_g;               /* 258 fest */
  byte ALS1_4_Setting_g;              /* 259 fest */
  byte ALS5_6_INREC_Setting_g;        /* 260 */
  byte ASIC_DIAGV_g;                      /* 261 */
  word A_Factor_ALS1_g;               /* 262,263 */
  word A_Factor_ALS2_g;               /* 264,265 */
  word A_Factor_ALS3_g;               /* 266,267 */
  word A_Factor_ALS4_g;               /* 268,269 */
  word A_Factor_ALS5_g;               /* 270,271 */
  word A_Factor_ALS6_g;               /* 272,273 */
  word A_Factor_INREC_g;              /* 274,275 */
  byte B_Factor_Iref_Lo_Gain_Lo_g;    /* 276 */
  byte B_Factor_Iref_Lo_Gain_Hi_g;    /* 277 */
  byte B_Factor_Iref_Hi_Gain_Lo_g;    /* 278 */
  byte B_Factor_Iref_Hi_Gain_Hi_g;    /* 279 */
  word CRC_Checksum_calibration_g;    /* 280,281 */       
  byte Standby_rain_measurement_1_g;  /*282*/
  byte Standby_rain_measurement_2_g;  /*283*/
  byte Standby_rain_measurement_3_g;  /*284*/
  byte Standby_rain_measurement_4_g;  /*285*/
  byte Standby_rain_measurement_5_g;  /*286*/
  byte Standby_rain_measurement_6_g;  /*287*/
  byte ASIC_Sched_Config_g ;            /*288*/ 
  byte ASIC_LCTR_g ;                  /*289*/ 
  byte NO_RAIN_PRESENT_THRSH_HB_g ;            /*290*/ 
  byte NO_RAIN_PRESENT_THRSH_LB_g ;            /*291*/ 
  byte STBY_REGV_Imbalance_g ;            /*292*/ 
  byte STBY_REGV_HB_g ;            /*293*/ 
  byte STBY_REGV_LB_g ;            /*294*/ 
  byte STBY_DELTA_INTV_HB_g ;            /*295*/ 
  byte STBY_DELTA_INTV_LB_g ;            /*296*/ 
  byte RSControlFlags;                /*297*/
  byte EEPROM_Erase_Counter;          /*298  */ 
  byte HardwareStand[2];              /* 299, 300*/          
  byte Produktionsdaten[4];           /* 301, 302, 303, 304 */
  byte Fertigungsdatum[3];            /* 305, 306, 307*/ 
  byte Parameterstand;                /*308*/ 
  byte NAD;                           /*309*/
  byte IDFSs_01;                      /*310*/
  byte IDRLSs_01;                     /*311*/
  byte IDBCM1_LIN1_01;                /*312*/
  byte IDWWSs_01;                     /*313*/
  byte IDSOSES_01 ;                   /*314*/ 
  byte ASIC_RCTR_REG_g ;              /*315*/ 
  byte ASIC_RFCTR_REG_g ;             /*316*/ 
  byte Error_Active_1_g ;             /*317*/   
  byte Error_Active_2_g ;             /*318*/   
  byte Error_Active_3_g ;             /*319*/   
  byte WatchdogResetCounter;          /*320*/  
  byte E2_Sensor_Error1_g;            /*321*/
  byte E2_Sensor_Error2_g;            /*322*/
  byte E2_Sensor_Error3_g;            /*323*/
  byte E2_Sensor_Error4_g;            /*324*/ 
  byte E2_Sensor_Error5_g;            /*325*/
  byte E2_Sensor_Error6_g;            /*326*/  
  byte IncidentCounter1_g;            /*327*/  
  byte IncidentCounter2_g;            /*328*/  
  byte IncidentCounter3_g;            /*329*/  
  byte IncidentCounter4_g;            /*330*/  
  byte IncidentCounter5_g;            /*331*/  
  byte IncidentCounter6_g;            /*332*/  
  byte IncidentCounter7_g;            /*333*/ 
  byte RS_GainSetupArray[6];          /*334,335,336,337,338,339*/    
  byte HALIOS_Clock_Control_Reg_g;    /*340*/
  byte ACTR_Reg_g;                    /*341*/
  byte PCO_PI_Regulator_g;            /*342*/
  byte ICO1H_g;                       /*343*/  
  byte ICO1L_g;                       /*344*/  
  byte ICO2H_g;                       /*345*/  
  byte ICO2L_g;                       /*346*/  
  byte FOSC_LEDUL_g;                  /*347*/ 
  byte INTCO_g;                       /*348*/  
  byte StandbyTimout;                 /*349*/ 
  byte Teilenummerindex;              /*350*/
  byte LIN_2_0_Variant_ID;            /*351*/ 
  byte RS_Sensitivity[9];             /*352,353,354,355,356,357,358,359,360*/            
  byte MaxOverwipeSensitivity;        /*361*/
  byte Stufe1_OG;                     /*362*/
  byte Stufe1_UG;                     /*363*/
  byte Ep_St2_Epr_In_St2;             /*364*/
  byte Schwelle_Schwall;              /*365*/  
  byte CW_AnsamlungAdditOffset;       /*366*/ 
  byte dec_Int_Sp_off;                /*367*/
  byte Dec_Stx_Speicher;              /*368*/
  byte dec_Ovr_Speicher;              /*369*/ 
  byte Empf_Faktor_ST2_Offs;          /*370*/
  byte Max_Signallaenge;              /*371*/
  byte rb_Stufe1_with_Int_og;         /*372*/
  byte Nachwisch_4_ST1_min;           /*373*/
  byte Nachwisch_3;                   /*374*/
  byte Nachwisch_2;                   /*375*/
  byte RSEmpfFactorScaling;           /*376*/   
  byte SchlierenFlag1;                /*377*/
  byte sig_ans_schw_offs;             /*378*/  
  byte StandbyModeScanTime_g;         /*379*/ 
  byte RainNightBitThrs_g;            /*380*/
  byte Amb_Base_Day_Threshold;        /*381*/
  byte Amb_Base_Night_Threshold;      /*382*/   
  byte TunnelDebounceFactor;          /*383*/                           
  byte Customer_FW_SWA_Scaling;       /*384*/
  byte Customer_IR_SWA_Scaling;       /*385*/
  byte FW_Base_Day_Threshold;         /*386*/
  byte IR_Base_Day_Threshold;         /*387*/
  byte FW_Base_Night_Threshold;       /*388*/
  byte IR_Base_Night_Threshold;       /*389*/    
  byte Day_Delay;                     /*390*/
  byte Night_Delay;                   /*391*/
  byte AfterTunnelDelayOffs;          /*392*/ 
  byte p_v_autobahn_on_off_g;         /*393*/
  byte p_t_autobahn_delay_on_g;       /*394*/
  byte Frontwaschen_Autobahndelay_g;    /*395*/  
  byte p_n_regenlichtschwelle_low_high_g;/*396*/ 
  byte p_n_regenlichtschwelle_Zeit_g;   /*397*/ 
  byte TunnelThresholdScaling_g;      /*398*/ 
  byte Amb_TunnelThresholdScaling_g;  /*399*/ 
  byte Regulation48Threshold_g;       /*400*/
  byte Regulation48LightOnTime_g;     /*401*/ 
  byte VeryBrightInTunnelDelay_g;     /*402*/ 
  byte Combined_FW_AL_THRs_g;         /*403*/ 
  byte DYN_COMP_CCD_MINUS_1_g;        /*404*/  
  byte DYN_COMP_CCD_MINUS_2_g;        /*405*/
  byte maxTemperatureOffsett_g;       /*406*/ 
  byte ASIC_AFSTHR_REG_g;              /*407*/ 
  byte GainOffsetE2_g;              /*408*/ 
  byte cb_inc_speicher_g;              /*409*/ 
  byte I2C_Debug_Config_g;            /*410*/ 

#ifdef ASIC_TEST
  byte ASIC_Frame_01_g;               /*411*/ 
  byte ASIC_Frame_02_g;               /*412*/ 
  byte ASIC_Frame_03_g;               /*413*/ 
  byte ASIC_Frame_04_g;               /*414*/ 
#endif
  
  byte SoftwareStand[4];              /* 415,416,417,418 */ 
  
} s_rb_I2CEEPROMStruct_g;






// Byte 44 CounterForWatchdogreset
// Byte 60 FehlerBild2!
// Byte 61 FehlerBild1!
// Byte 62 ASIC Mode
// Byte 63 ASIC Clock


/* PRQA S 750 6 *//*<< 0750:union needed to reduce RAM usage >>*/
typedef union {
  unsigned char _c[cb_NumberofEEPROMCells_g];
  s_rb_I2CEEPROMStruct_g I2CEEPROMStruct;
} s_rb_I2CEEPROMStruct_buff_g;


#define cb_NUMBER_OF_PROD_DATA_g 12
#define cb_PROD_DATA_START_ADRESS_g (498-256)

/* PRQA S 3116,0759 4*//*<< 3116:#pragma needed for IAR compiler and MISRA, 0759:union needed to reduce RAM usage >>*/

EXTERN  s_rb_I2CEEPROMStruct_buff_g I2C_EEPROM_Struct;
EXTERN  byte rab_EEPROM_ProductionData_g[cb_NUMBER_OF_PROD_DATA_g];

#define rb_Kodierbyte0_g                                I2C_EEPROM_Struct.I2CEEPROMStruct.EEKodierbyte0_g //Address 128
#define rb_Kodierbyte1_g                                I2C_EEPROM_Struct.I2CEEPROMStruct.EEKodierbyte1_g //Address 129
