#ifndef G5_DIAGE2MAPPING_AD_H
#define G5_DIAGE2MAPPING_AD_H
/* PRQA S 3619 EOF */ /* << 2010 01 08, compiler allows whitespaces:due to readable code, keep whitespaces! >> */
/* PRQA S 2217 EOF */ /* << 2011 03 03, Code would be not readable >> */
/* PRQA S 750,759 EOF *//*<< 0750:union needed to reduce RAM usage >>*/
/* PRQA S 1015 EOF *//*<< 1015:__far needed for IAR compiler  >>*/
/* PRQA S 3453 EOF *//*<< Macro is more readle and convinient in this situation >>*/
/* PRQA S 857 EOF *//*<< Macro exceeds 1024 number  >>*/
/****************************************************************************************************************/
/* History                                                                                                      */
/****************************************************************************************************************/
/* Date         VDR_Number     Description                                                                      */
/*18.11.14      VCO_189                 DEBUG:Change the I2C debug data mapping                                 */
/*27.11.14      VDR_825         MP      Diagnostic pulse - change the wait time                                 */
/*09.12.14      VCO_204         NB      Project specific extensions in the main stream                          */
/*01.04.15      VCO_239         MP      Light values filter defined in EEPROM                                   */

  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*685*/    
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*686*/    
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*687*/    
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*688*/    
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*689*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*690*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*691*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*692*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*693*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*694*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*695*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*696*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*697*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*698*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*699*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*700*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*701*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*702*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*703*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*704*/  
  {UNUSED                                ,UNUSED                                ,UNUSED                                },       /*705*/   
#endif  
};


#else

extern const byte __far cb_EEPROMDataDefaultMinMax_AD_g[cb_NumberofEEPROMCells_AD_g][3];
#define EXTERN  extern
#endif

typedef struct {
 
  byte Stufe1_OG;                     
  byte Stufe1_UG;                     
  byte Ep_St2_Epr_In_St2;             
  byte Schwelle_Schwall;             
  byte CW_AnsamlungAdditOffset;      
  byte dec_Int_Sp_off;                
  byte Dec_Stx_Speicher;             
  byte dec_Ovr_Speicher;               
  byte Empf_Faktor_ST2_Offs;          
  byte Max_Signallaenge;              
  byte rb_Stufe1_with_Int_og;         
  byte Nachwisch_4_ST1_min;           
  byte Nachwisch_3;                   
  byte Nachwisch_2;                   
  byte RSEmpfFactorScaling;           
  byte SchlierenFlag1;                
  byte sig_ans_schw_offs;            
  
}s_rb_PrametersStruct_g;



typedef struct {
 s_rb_PrametersStruct_g PrametersStruct[4]; /* 512 to 579 */
  byte RS_GainSetupArray[6];          /*580,581,582,583,584,585*/    
  byte HALIOS_Clock_Control_Reg_g;    /*586*/
  byte ACTR_Reg_g;                    /*587*/
  byte PCO_PI_Regulator_g;            /*588*/
  byte ICO1H_g;                       /*589*/  
  byte ICO1L_g;                       /*590*/  
  byte ICO2H_g;                       /*591*/  
  byte ICO2L_g;                       /*592*/  
  byte FOSC_LEDUL_g;                  /*593*/ 
  byte INTCO_g;                       /*594*/  
  byte StandbyTimout;                 /*595*/ 
  byte dec_st2_speicher;              /*596*/ 
  byte RS_Sensitivity[9];             /*597,598,599,600,601,602,603,604,605*/            
  byte MaxOverwipeSensitivity;        /*606*/  
  byte StandbyModeScanTime_g;         /*607*/ 
  byte RainNightBitThrs_g;            /*608*/
  byte Amb_Base_Day_Threshold;        /*609*/
  byte Amb_Base_Night_Threshold;      /*610*/   
  byte TunnelDebounceFactor;          /*611*/                           
  byte Customer_FW_SWA_Scaling;       /*612*/
  byte Customer_IR_SWA_Scaling;       /*613*/
  byte FW_Base_Day_Threshold;         /*614*/
  byte IR_Base_Day_Threshold;         /*615*/
  byte FW_Base_Night_Threshold;       /*616*/
  byte IR_Base_Night_Threshold;       /*617*/    
  byte Day_Delay;                     /*618*/
  byte Night_Delay;                   /*619*/
  byte AfterTunnelDelayOffs;          /*620*/ 
  byte p_v_autobahn_on_off_g;         /*621*/
  byte p_t_autobahn_delay_on_g;       /*622*/
  byte Frontwaschen_Autobahndelay_g;    /*623*/  
  byte p_n_regenlichtschwelle_low_high_g;/*624*/ 
  byte p_n_regenlichtschwelle_Zeit_g;   /*625*/ 
  byte TunnelThresholdScaling_g;      /*626*/ 
  byte Amb_TunnelThresholdScaling_g;  /*627*/ 
  byte spare;                         /*628*/ /* old: Regulation48Threshold_g */
  byte Regulation48LightOnTime_g;     /*629*/ 
  byte VeryBrightInTunnelDelay_g;     /*630*/ 
  byte Combined_FW_AL_THRs_g;         /*631*/ 
  byte DYN_COMP_CCD_MINUS_1_g;        /*632*/  
  byte DYN_COMP_CCD_MINUS_2_g;        /*633*/
  byte maxTemperatureOffsett_g;       /*634*/ 
  byte ASIC_AFSTHR_REG_g;              /*635*/ 
  byte Diag_Request_Factor_g;          /*636*/ 
  byte cb_inc_speicher_g;              /*637*/ 
  byte I2C_Debug_Config_g;             /*638*/ 
  byte Audi_SW_Partnumber[8];          /*639,640,641,642,643,644,645,646*/ 
  byte wiperSpeedHysteresis;           /*647*/   
  byte Proj_Specific_config;           /*648*/   
  byte ALSx_Filter_g;                  /*649*/   
  byte IrLightTunnelThreshodRng;       /*650*/   
  byte FwLightTunnelThresholdRng;      /*651*/   
  byte AmbLightTunnelThresholdRng;     /*652*/
  /*VCO_260 Tunnel wipe activation and delay according to Tunnel Verzoegerung and Aktivierung parameters*/
  byte TunWischVerzAktiv;              /*653*/   
  byte SHTErrorDebounceJitter;         /*654*/   
  byte SolarShadowCorrFactor1;         /*655*/   
  byte SolarShadowCorrFactor2;         /*656*/   
  byte E2_MaxSt2SignalLaenge;          /*657*/   
      
  byte SoftwareStand[4];              /* 658,659,660,661 */
  
  byte twilightToDarkTime;              /*662*/
  byte darkToTwilightTime;              /*663*/
  
  byte darkToTwilightThreshFW;          /*664*/
  byte darkToTwilightThreshAMB;         /*665*/
  
  byte twilightToDarkThreshFW;          /*666*/
  byte twilightToDarkThreshAMB;         /*667*/
  byte iceDetectionTemperature;         /*668*/
  byte Regulation48ThresholdAmb_g;      /*669*/  
  byte Regulation48ThresholdFw_g;       /*670*/ 
#if defined FORD
  byte CarCode[16];                     /*671-686*/
  byte DoubleOverwiped[2];              /*687-688*/ 
  byte Butterfly[2];                    /*689-690*/ 
  byte RsConfig;                        /*691*/ 
  byte RsSensMapping;                   /*692*/ 
  byte WiperSignal;                     /*693*/ 
  byte WiperMotorTime;                  /*694*/ 
  byte PartNumber[6];                   /*695-700*/ 
  byte FadeOut;                         /*701*/ 
  byte SensitivityBarrier;              /*702*/
  byte Threshold_FirstOverwipe_Start;   /*703*/
  byte Threshold_FirstOverwipe_End;     /*704*/
  byte Threshold_Overwipe;              /*705*/
#else
  byte Threshold_TempIceRisk;           /*671*/ 
  byte upperTolerance_StartupWipe;      /*672*/   
  byte unused[33];
#endif  

} s_rb_EEPROMStruct_AD_g;



typedef union {
  unsigned char _c[cb_NumberofEEPROMCells_AD_g];
  s_rb_EEPROMStruct_AD_g EEPROMStructAD;
} s_rb_EEPROMStructAD_buff_g;




/* PRQA S 3116,0759 4*//*<< 3116:#pragma needed for IAR compiler and MISRA, 0759:union needed to reduce RAM usage >>*/

EXTERN  s_rb_EEPROMStructAD_buff_g EEPROM_Struct_AD;


/* PRQA S 3453 1*/ /*<< Function type is required by MISRA, but unions are already used! >>*/
#define rab_RS_GainSetupArray(a)                        ((((EEPROM_Struct_AD.EEPROMStructAD.RS_GainSetupArray[((a)/2)])<<(((a)&0x01)*4))&0xF0)|((EEPROM_Struct_AD.EEPROMStructAD.RS_GainSetupArray[5])&0x0F)) 
#define rb_HALIOS_Clock_Control_Reg_g 			EEPROM_Struct_AD.EEPROMStructAD.HALIOS_Clock_Control_Reg_g  
#define rb_ACTR_Reg_g					EEPROM_Struct_AD.EEPROMStructAD.ACTR_Reg_g  
#define rb_PCO_PI_Regulator_g				EEPROM_Struct_AD.EEPROMStructAD.PCO_PI_Regulator_g  
